Masmiseim36/nxpSDK/boards/frdmke16z/demo_apps/mc_bldc/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC0 (number 23), J2[7]/GES_R0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FTM0_CH0_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_FTM0_CH0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_FTM0_CH0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTC1 (number 22), J2[9]/GES_R1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FTM0_CH1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_FTM0_CH1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_FTM0_CH1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTD0 (number 2), J1[12]/J3[11]/Arduino_D5/MC_PWM_BT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FTM0_CH2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_FTM0_CH2_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_FTM0_CH2_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTD1 (number 1), D4[3]/RGB_BLUE
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FTM0_CH3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_FTM0_CH3_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_FTM0_CH3_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTB4 (number 16), D4[4]/RGB_GREEN
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FTM0_CH4_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_FTM0_CH4_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_FTM0_CH4_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTB5 (number 15), D4[1]/RGB_RED
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FTM0_CH5_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_FTM0_CH5_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_FTM0_CH5_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_FTM(void);

/*! @name PORTD3 (number 33), J1[10]/BUTTON_0/SW2/Arduino_D4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW2_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_SW2_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

/*! @name PORTB1 (number 26), UART0_TX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_TX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_TX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB0 (number 27), UART0_RX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_RX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_RX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_LPUART(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
